ChibiOS/ChibiOS-Contrib/os/hal/ports/AT32/AT32F415/at32_registry.h
#define AT32_HAS_UART4                     TRUE

#if (AT32_DMA_USE_DMAMUX == TRUE) || defined(__DOXYGEN__)
#define AT32_UART_UART4_RX_DMA_STREAM      AT32_DMA_STREAM_ID(2, 1)
#define AT32_UART_UART4_TX_DMA_STREAM      AT32_DMA_STREAM_ID(2, 2)
#define AT32_UART_UART4_RX_DMAMUX_CHANNEL  1
#define AT32_UART_UART4_TX_DMAMUX_CHANNEL  2
#else
#define AT32_UART_UART4_RX_DMA_STREAM      AT32_DMA_STREAM_ID(2, 3)
#define AT32_UART_UART4_TX_DMA_STREAM      AT32_DMA_STREAM_ID(2, 5)
#endif

#define AT32_HAS_UART5                     TRUE

#if (AT32_DMA_USE_DMAMUX == TRUE) || defined(__DOXYGEN__)
#define AT32_UART_UART5_RX_DMA_STREAM      AT32_DMA_STREAM_ID(2, 1)
#define AT32_UART_UART5_TX_DMA_STREAM      AT32_DMA_STREAM_ID(2, 2)
#define AT32_UART_UART5_RX_DMAMUX_CHANNEL  1
#define AT32_UART_UART5_TX_DMAMUX_CHANNEL  2
#endif

#define AT32_HAS_USART6                    FALSE
#define AT32_HAS_UART7                     FALSE
#define AT32_HAS_UART8                     FALSE

/* USB attributes.*/
#define AT32_OTG_STEPPING                  1

#define AT32_HAS_OTG1                      TRUE
#define AT32_OTG1_ENDPOINTS                3

#define AT32_HAS_OTG2                      FALSE

/* WDT attributes.*/
#define AT32_HAS_WDT                       TRUE
#define AT32_WDT_IS_WINDOWED               FALSE
/** @} */
#endif /* defined(AT32F415R_MD) */

#if defined(AT32F415R_HD) || defined(__DOXYGEN__)
/**
 * @name    AT32F415R HD capabilities
 * @{
 */
/* ADC attributes.*/
#define AT32_HAS_ADC1                      TRUE

#if (AT32_DMA_USE_DMAMUX == TRUE) || defined(__DOXYGEN__)
#define AT32_ADC_ADC1_DMA_STREAM           AT32_DMA_STREAM_ID(1, 2)
#define AT32_ADC_ADC1_DMAMUX_CHANNEL       2
#else
#define AT32_ADC_ADC1_DMA_STREAM           AT32_DMA_STREAM_ID(1, 1)
#endif

/* CAN attributes.*/
#define AT32_HAS_CAN1                      TRUE
#define AT32_CAN_MAX_FILTERS               14

/* DMA attributes.*/
#define AT32_ADVANCED_DMA                  FALSE

#if (AT32_DMA_USE_DMAMUX == TRUE) || defined(__DOXYGEN__)
#define AT32_DMA_SUPPORTS_DMAMUX           TRUE
#else
#define AT32_DMA_SUPPORTS_DMAMUX           FALSE
#endif

#define AT32_DMA1_NUM_CHANNELS             7
#define AT32_DMA2_NUM_CHANNELS             7

/* EXINT attributes.*/
#define AT32_EXINT_NUM_LINES               23
#define AT32_EXINT_INTEN_MASK              0x00000000U

/* FLASH attributes.*/
#define AT32_FLASH_NUMBER_OF_BANKS         1
#define AT32_FLASH_SECTOR_SIZE             2048U

#if !defined(AT32_FLASH_SECTORS_PER_BANK) || defined(__DOXYGEN__)
#define AT32_FLASH_SECTORS_PER_BANK        128 /* Maximum, can be redefined.*/
#endif

/* GPIO attributes.*/
#define AT32_HAS_GPIOA                     TRUE
#define AT32_HAS_GPIOB                     TRUE
#define AT32_HAS_GPIOC                     TRUE
#define AT32_HAS_GPIOD                     TRUE
#define AT32_HAS_GPIOF                     TRUE

/* I2C attributes.*/
#define AT32_HAS_I2C1                      TRUE

#if (AT32_DMA_USE_DMAMUX == TRUE) || defined(__DOXYGEN__)
#define AT32_I2C_I2C1_RX_DMA_STREAM        AT32_DMA_STREAM_ID(1, 3)
#define AT32_I2C_I2C1_TX_DMA_STREAM        AT32_DMA_STREAM_ID(1, 4)
#define AT32_I2C_I2C1_RX_DMAMUX_CHANNEL    3
#define AT32_I2C_I2C1_TX_DMAMUX_CHANNEL    4
#else
#define AT32_I2C_I2C1_RX_DMA_STREAM        AT32_DMA_STREAM_ID(1, 7)
#define AT32_I2C_I2C1_TX_DMA_STREAM        AT32_DMA_STREAM_ID(1, 6)
#endif

#define AT32_HAS_I2C2                      TRUE

#if (AT32_DMA_USE_DMAMUX == TRUE) || defined(__DOXYGEN__)
#define AT32_I2C_I2C2_RX_DMA_STREAM        AT32_DMA_STREAM_ID(1, 3)
#define AT32_I2C_I2C2_TX_DMA_STREAM        AT32_DMA_STREAM_ID(1, 4)
#define AT32_I2C_I2C2_RX_DMAMUX_CHANNEL    3
#define AT32_I2C_I2C2_TX_DMAMUX_CHANNEL    4
#else
#define AT32_I2C_I2C2_RX_DMA_STREAM        AT32_DMA_STREAM_ID(1, 5)
#define AT32_I2C_I2C2_TX_DMA_STREAM        AT32_DMA_STREAM_ID(1, 4)
#endif

#define AT32_HAS_I2C3                      FALSE

/* ERTC attributes.*/
#define AT32_HAS_ERTC                      TRUE
#define AT32_ERTC_HAS_SUBSECONDS           TRUE
#define AT32_ERTC_HAS_PERIODIC_WAKEUPS     TRUE
#define AT32_ERTC_NUM_ALARMS               2
#define AT32_ERTC_STORAGE_SIZE             80

/* QUADSPI attributes.*/
#define AT32_HAS_QUADSPI1                  FALSE

/* SDIO attributes.*/
#define AT32_HAS_SDIO1                     TRUE

#if (AT32_DMA_USE_DMAMUX == TRUE) || defined(__DOXYGEN__)
#define AT32_SDC_SDIO1_DMA_STREAM          AT32_DMA_STREAM_ID(1, 5)
#define AT32_SDC_SDIO1_DMAMUX_CHANNEL      5
#else
#define AT32_SDC_SDIO1_DMA_STREAM          AT32_DMA_STREAM_ID(2, 4)
#endif

/* SPI attributes.*/
#define AT32_HAS_SPI1                      TRUE
#define AT32_SPI1_SUPPORTS_I2S             TRUE
#define AT32_SPI1_I2S_FULLDUPLEX           FALSE

#if (AT32_DMA_USE_DMAMUX == TRUE) || defined(__DOXYGEN__)
#define AT32_SPI_SPI1_RX_DMA_STREAM        AT32_DMA_STREAM_ID(1, 6)
#define AT32_SPI_SPI1_TX_DMA_STREAM        AT32_DMA_STREAM_ID(1, 7)
#define AT32_SPI_SPI1_RX_DMAMUX_CHANNEL    6
#define AT32_SPI_SPI1_TX_DMAMUX_CHANNEL    7
#else
#define AT32_SPI_SPI1_RX_DMA_STREAM        AT32_DMA_STREAM_ID(1, 2)
#define AT32_SPI_SPI1_TX_DMA_STREAM        AT32_DMA_STREAM_ID(1, 3)
#endif

#define AT32_HAS_SPI2                      TRUE
#define AT32_SPI2_SUPPORTS_I2S             TRUE
#define AT32_SPI2_I2S_FULLDUPLEX           FALSE

#if (AT32_DMA_USE_DMAMUX == TRUE) || defined(__DOXYGEN__)
#define AT32_SPI_SPI2_RX_DMA_STREAM        AT32_DMA_STREAM_ID(1, 6)
#define AT32_SPI_SPI2_TX_DMA_STREAM        AT32_DMA_STREAM_ID(1, 7)
#define AT32_SPI_SPI2_RX_DMAMUX_CHANNEL    6
#define AT32_SPI_SPI2_TX_DMAMUX_CHANNEL    7
#else
#define AT32_SPI_SPI2_RX_DMA_STREAM        AT32_DMA_STREAM_ID(1, 4)
#define AT32_SPI_SPI2_TX_DMA_STREAM        AT32_DMA_STREAM_ID(1, 5)
#endif

#define AT32_HAS_SPI3                      FALSE

/* TMR attributes.*/
#define AT32_TMR_MAX_CHANNELS              4

#define AT32_HAS_TMR1                      TRUE
#define AT32_TMR1_IS_32BITS                FALSE
#define AT32_TMR1_CHANNELS                 4

#define AT32_HAS_TMR2                      TRUE
#define AT32_TMR2_IS_32BITS                TRUE
#define AT32_TMR2_CHANNELS                 4

