ChibiOS/ChibiOS-Contrib/os/hal/ports/AT32/AT32F415/at32_registry.h
#define AT32_HAS_TMR3                      TRUE
#define AT32_TMR3_IS_32BITS                FALSE
#define AT32_TMR3_CHANNELS                 4

#define AT32_HAS_TMR4                      TRUE
#define AT32_TMR4_IS_32BITS                FALSE
#define AT32_TMR4_CHANNELS                 4

#define AT32_HAS_TMR5                      TRUE
#define AT32_TMR5_IS_32BITS                TRUE
#define AT32_TMR5_CHANNELS                 4

#define AT32_HAS_TMR9                      TRUE
#define AT32_TMR9_IS_32BITS                FALSE
#define AT32_TMR9_CHANNELS                 2

#define AT32_HAS_TMR10                     TRUE
#define AT32_TMR10_IS_32BITS               FALSE
#define AT32_TMR10_CHANNELS                1

#define AT32_HAS_TMR11                     TRUE
#define AT32_TMR11_IS_32BITS               FALSE
#define AT32_TMR11_CHANNELS                1

#define AT32_HAS_TMR6                      FALSE
#define AT32_HAS_TMR7                      FALSE
#define AT32_HAS_TMR13                     FALSE
#define AT32_HAS_TMR14                     FALSE

/* USART attributes.*/
#define AT32_HAS_USART1                    TRUE

#if (AT32_DMA_USE_DMAMUX == TRUE) || defined(__DOXYGEN__)
#define AT32_UART_USART1_RX_DMA_STREAM     AT32_DMA_STREAM_ID(2, 1)
#define AT32_UART_USART1_TX_DMA_STREAM     AT32_DMA_STREAM_ID(2, 2)
#define AT32_UART_USART1_RX_DMAMUX_CHANNEL 1
#define AT32_UART_USART1_TX_DMAMUX_CHANNEL 2
#else
#define AT32_UART_USART1_RX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 5)
#define AT32_UART_USART1_TX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 4)
#endif

#define AT32_HAS_USART2                    TRUE

#if (AT32_DMA_USE_DMAMUX == TRUE) || defined(__DOXYGEN__)
#define AT32_UART_USART2_RX_DMA_STREAM     AT32_DMA_STREAM_ID(2, 1)
#define AT32_UART_USART2_TX_DMA_STREAM     AT32_DMA_STREAM_ID(2, 2)
#define AT32_UART_USART2_RX_DMAMUX_CHANNEL 1
#define AT32_UART_USART2_TX_DMAMUX_CHANNEL 2
#else
#define AT32_UART_USART2_RX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 6)
#define AT32_UART_USART2_TX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 7)
#endif

#define AT32_HAS_USART3                    TRUE

#if (AT32_DMA_USE_DMAMUX == TRUE) || defined(__DOXYGEN__)
#define AT32_UART_USART3_RX_DMA_STREAM     AT32_DMA_STREAM_ID(2, 1)
#define AT32_UART_USART3_TX_DMA_STREAM     AT32_DMA_STREAM_ID(2, 2)
#define AT32_UART_USART3_RX_DMAMUX_CHANNEL 1
#define AT32_UART_USART3_TX_DMAMUX_CHANNEL 2
#else
#define AT32_UART_USART3_RX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 3)
#define AT32_UART_USART3_TX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 2)
#endif

#define AT32_HAS_UART4                     TRUE

#if (AT32_DMA_USE_DMAMUX == TRUE) || defined(__DOXYGEN__)
#define AT32_UART_UART4_RX_DMA_STREAM      AT32_DMA_STREAM_ID(2, 1)
#define AT32_UART_UART4_TX_DMA_STREAM      AT32_DMA_STREAM_ID(2, 2)
#define AT32_UART_UART4_RX_DMAMUX_CHANNEL  1
#define AT32_UART_UART4_TX_DMAMUX_CHANNEL  2
#else
#define AT32_UART_UART4_RX_DMA_STREAM      AT32_DMA_STREAM_ID(2, 3)
#define AT32_UART_UART4_TX_DMA_STREAM      AT32_DMA_STREAM_ID(2, 5)
#endif

#define AT32_HAS_UART5                     TRUE

#if (AT32_DMA_USE_DMAMUX == TRUE) || defined(__DOXYGEN__)
#define AT32_UART_UART5_RX_DMA_STREAM      AT32_DMA_STREAM_ID(2, 1)
#define AT32_UART_UART5_TX_DMA_STREAM      AT32_DMA_STREAM_ID(2, 2)
#define AT32_UART_UART5_RX_DMAMUX_CHANNEL  1
#define AT32_UART_UART5_TX_DMAMUX_CHANNEL  2
#endif

#define AT32_HAS_USART6                    FALSE
#define AT32_HAS_UART7                     FALSE
#define AT32_HAS_UART8                     FALSE

/* USB attributes.*/
#define AT32_OTG_STEPPING                  1

#define AT32_HAS_OTG1                      TRUE
#define AT32_OTG1_ENDPOINTS                3

#define AT32_HAS_OTG2                      FALSE

/* WDT attributes.*/
#define AT32_HAS_WDT                       TRUE
#define AT32_WDT_IS_WINDOWED               FALSE
/** @} */
#endif /* defined(AT32F415R_HD) */

#endif /* AT32_REGISTRY_H */

/** @} */
